import random
import time
from telethon.sync import TelegramClient
from datetime import datetime, timedelta

api_id = '26616577'
api_hash = 'b84c63aa98e2c8ee0ee09494f694382b'
phone_number = '+989389232279'

good_morning_messages = [
    "صبح بخیر، عشقم. نفس‌هایم هر صبح با حضور تو دوباره زنده می‌شود.",
    "صبح بخیر، نازنین دلم. بوسه‌های نورانی صبح، روحم را با عشق و شادی پر می‌کنند.",

    "صبح بخیر، معشوقهٔ قلبم. در دنیای من، تو خورشیدی که همیشه می‌تابی.",

    "صبح بخیر، عشق من. در هر لحظهٔ صبحانهٔ زندگیم، تو را به تمامیت تجربه می‌کنم.",

    "صبح بخیر، دلبرم. در آغوش تو، هر روز دوباره به زندگی عشق می‌بخشم.",

    "صبح بخیر، جانم. هر صبح با دیدار تو، به حس ناب عشق بیدار می‌شوم.",

    "صبح بخیر، محبت من. نگاهت همیشه نوری است که در تاریکی روزم را روشن می‌کند.",

    "صبح بخیر، عزیز دلم. امروز همانطور که همیشه، در تمامیت عشق خواهم بود.",

    "صبح بخیر، عشق بی‌پایانم. همهٔ رویاهایم با تو به واقعیت پیوسته است.",

    "صبح بخیر، عشقم. هر روز با تو، دنیای جدیدی از عشق و شادی را کشف می‌کنم.",

    "صبح بخیر، آرامش دلم. صدای نفس‌های تو همچون آواز فرشتگان در گوشانم می‌نوازد.",

    "صبح بخیر، پرندهٔ آزاد دلم. با تو در کنارم، به ارتفاعات عشق پرواز می‌کنم.",

    "صبح بخیر، شعلهٔ عشق من. در هر نفسی، عشق تو درون من شعله ور می‌شود.",

    "صبح بخیر، عشقِ ناگفته‌ام. هر صبح به تمام زیبایی‌های تو غرق می‌شوم.",

    "صبح بخیر، قطرهٔ عشقم. در هر قطره از صبح، عشق تو را در دلم می‌بینم.",

    "صبح بخیر، زیبایی آسمانی من. در طلوع خورشید، زندگی را با تو شروع می‌کنم.",

    "صبح بخیر، دنیای زیبای من. با تو هر صبح، شاهد عشقی ناب در کنارم هستم.",

    "صبح بخیر، خندهٔ دلانگیزم. صدای خنده‌ات، همه گوش‌ها را به سوی شادی می‌چرخاند.",
 
    "صبح بخیر، نغمهٔ آرامش من. صدای تو هر صبح، به دلم نوای عشق و آرامش می‌دهد.",

    "صبح بخیر، پنجرهٔ روشنایی من. با تو، هر صبح، دیدن جهان با نگاه عاشقانه‌ام را دوست دارم.",

    "صبح بخیر، روح نوید دلم. همراه با تو، هر صبح یک فصل عشق جدید را تجربه می‌کنم.",

    "صبح بخیر، جادوی بیداری من. حضور تو همه چیز را به رنگ و بوی عشق تغییر می‌دهد.",

    "صبح بخیر، شعلهٔ امیدم. هر صبح با تو، احساس می‌کنم که همه چیز ممکن است.",

    "صبح بخیر، پنجرهٔ عشقم. با دیدن تو، هر صبح جهان را با نگاهی عاشقانه دوباره می‌سازم.",

    "صبح بخیر، نور خواب بیدارم. هر صبح با تو، رویاهایم به واقعیت می‌پیوندند.",

    "صبح بخیر، طعم عشق من. همیشه به شیرینی تو در صبح‌هایم اعتماد دارم.",

    "صبح بخیر، آوای عشقم. در هر نفسی، صدای تو به گوشمان آرامش و شادی می‌آورد.",

    "صبح بخیر، نقش هنرم. هر صبح با تو، به طراحی زندگی عشق می‌برم.",

    "صبح بخیر، قصهٔ زندگی من. با تو، هر روز یک باب کتاب عشق را باز می‌کنم.",

    "صبح بخیر، انسان بی‌نقصم. در هر صبح با تو، همه جا پر از کمال و عشق می‌شود.",

    "صبح بخیر، پروانهٔ احساساتم. با تو، هر صبح در باغ عشق پرواز می‌کنم.",

    "صبح بخیر، جادوگر زندگی من. هر صبح با تو، جادوی عشق برایم به اجرا در می‌آید.",

    "صبح بخیر، قطرهٔ شگفتی من. هر صبح با تو، در دیدار یکدیگر، به عجایب عشق پی می‌بریم.",

    "صبح بخیر، مهربانی قلبم. با تو، هر روز یک صفحهٔ جدید از داستان عشق می‌نویسم.",

    "صبح بخیر، آفتاب عشقم. با طلوع تو، تمام تاریکی‌های زندگیم روشن می‌شود.",

    "صبح بخیر، آغازگر عشق من. هر صبح با تو، به راه عشق جدیدی پا می‌گذارم.",

    "صبح بخیر، رویاهایم. هر صبح با تو، رویاهایم به واقعیت پیوسته است.",

    "صبح بخیر، اندیشهٔ خوبم. همهٔ روزهای زندگیم با تفکر دربارهٔ تو آغاز می‌شود.",

    "صبح بخیر، آتش عشق من. در هر صبح، دلم به شعلهٔ عشق تو می‌سوزد.",

    "صبح بخیر، سرود عاشقانهٔ زندگی من. هر صبح با تو، یک قطعهٔ زیبا از زندگی را باز می‌نوازم.",

    "صبح بخیر، بوی عشقم. هر صبح، عطر تو در هوا به من می‌رسد و قلبم را می‌پروراند.",

    "صبح بخیر، طلوع عشق من. هر صبح با تو، دنیایم به نور عشق تو تغییر می‌کند.",

    "صبح بخیر، نفس عشقم. با تو، هر صبح زندگی را با شور و هیجان تنفس می‌کنم.",

    "صبح بخیر، شاعر قلبم. در هر صبح با تو، به سروده‌های عاشقانهٔ قلبم ادامه می‌دهم.",

    "صبح بخیر، مهربانی بی‌پایانم. هر صبح با تو، دنیایم به لطف و مهر تو پر می‌شود.",

    "صبح بخیر، قهوهٔ تازهٔ زندگی من. هر صبح با تو، نوشیدن از لذت‌های عشق را تجربه می‌کنم.",

    "صبح بخیر، رویای زندگی من. هر صبح با تو، در دنیای رویاها قدم می‌گذارم.",

    "صبح بخیر، طراوت عشقم. همیشه با تو، زندگی را به تازگی و شادابی تجربه می‌کنم.",

    "صبح بخیر، زندگی عشق من. هر صبح با تو، زندگی را به ابتکار و شور عشق پر می‌کنم.",

    "صبح بخیر، شعلهٔ عشقم. هر صبح با تو، شعله‌های عشق در دلم به سوی آسمان می‌رقصند.",
 
    "صبح بخیر، رنگین‌کمان عشق من. با تو، هر صبح هفت رنگ عشق را در زندگی تجربه می‌کنم.",

    "صبح بخیر، شمع عشقم. هر صبح با تو، دلم را با نور عشق روشن می‌کنم.",

    "صبح بخیر، پرستوی عشق من. هر صبح با تو، به سوی آسمان عشق پرواز می‌کنم.",

    "صبح بخیر، غرق عشقم. در هر صبح، در بحر عشق تو غرق می‌شوم.",

    "صبح بخیر، آغوش عشق من. هر صبح با تو، به آغوش عشقت می‌پیوندم و دنیایم را تازه می‌کنم.",

    "صبح بخیر، باران عشقم. با تو، هر صبح در قطرات باران عشقت غرق می‌شوم.",

    "صبح بخیر، قصهٔ دوستی عشق من. هر صبح با تو، در صفحات قصهٔ دوستیم راوی خاطرات می‌شوم.",

    "صبح بخیر، جوانمردی عشقم. هر صبح با تو، قدم‌هایم را در راه عشق پایبند می‌کنم.",

    "صبح بخیر، شب‌های تنهاییم. هر صبح با تو، خاطرات شب را به فراموشی می‌سپارم و در خواب تو به روزی جدید خوشبختی پا می‌گذارم.",

    "صبح بخیر، پروانهٔ رویاهایم. با تو، هر صبح به پرواز در باغ عشق می‌پردازم.",

    "صبح بخیر، نسیم عشقم. هر صبح با تو، نسیم عاشقانهٔ عشق را در دلم احساس می‌کنم.",

    "صبح بخیر، طلاقوهٔ زندگی من. هر صبح با تو، به آبهای زندگیم زندگی جدیدی می‌بخشم.",

    "صبح بخیر، ستارهٔ هدایت من. در هر صبح با تو، راه روشنی را در زندگیم پیدا می‌کنم.",

    "صبح بخیر، نقشهٔ عشق من. هر صبح با تو، در نقشهٔ عشق راه را برای زندگیم پیدا می‌کنم.",

    "صبح بخیر، دوستی صمیمی من. با تو، هر صبح در کنار دوست وفادارم به روزی جدید خوشبختی می‌پیوندم.",

    "صبح بخیر، گل‌های عشق من. هر صبح با تو، به دنیای گل‌های عشق پا می‌گذارم.",

    "صبح بخیر، نغمهٔ شادی من. هر صبح با تو، در آواز شادی و خوشبختی عشق می‌سرایم.",

    "صبح بخیر، دلنوازی عشقم. هر صبح با تو، دلم را به نغمهٔ عشقت می‌نوازم.",

    "صبح بخیر، شمعدان عشق من. هر صبح با تو، قلبم را در برابر نور عشقت می‌گذارم.",

    "صبح بخیر، باران عاشقانهٔ عشقم. هر صبح با تو، در قطرات باران عشقت غرق می‌شوم.",
  
    "صبح بخیر، اسرار عشق من. هر صبح با تو، در اسرار و رمزهای عشق تو می‌خوانم.",

    "صبح بخیر، برقص عشقم. هر صبح با تو، در رقص عاشقانهٔ زندگی خوشحالی می‌کنم.",

    "صبح بخیر، امید عشقم. هر صبح با تو، امید به فردای روشنی را در دلم حمل می‌کنم.",

    "صبح بخیر، نسیم عاشقانهٔ عشقم. هر صبح با تو، در نسیم عشق تو راحتی و آرامش می‌یابم.",

    "صبح بخیر، قطرهٔ عشقم. هر صبح با تو، قلبم را به نوید عشقت می‌بخشم.",

    "صبح بخیر، رنگین کمان عشق من. هر صبح با تو، در دنیای رنگین کمان عشق پراکنده می‌شوم.",

    "صبح بخیر، نقش هنرمندی عشق من. هر صبح با تو، در نقشهای عاشقانهٔ زندگیم به رقص می‌پردازم.",

    "صبح بخیر، نغمهٔ عشقم. هر صبح با تو، در صدای عشقت شادی و آرامش می‌یابم.",

    "صبح بخیر، جادهٔ عشق من. با تو، هر صبح در جادهٔ عشق پیش می‌روم و آرزوهایم را به واقعیت تبدیل می‌کنم.",

    "صبح بخیر، ستارهٔ هدایت عشق من. در هر صبح با تو، به راهنمایی تو در زندگیم پایبند می‌شوم.",

]

good_night_messages = [
    "شب بخیر، عشق من. در آغوش تاریکی شب، فکر تو را همیشه در دل خود نگه دارم.",

    "شب بخیر، نازنینم. در خاطره‌های نیمه شب، صدای آرام تو را به خواب می‌برم.",

    "شب بخیر، مهتاب عشقم. تمام اشعار عشقم را در زبان ستاره‌ها برای تو می‌نویسم.",

    "شب بخیر، شاعر دلم. هر شب در بغض تو شعرهای عاشقانه می‌آویزم.",

    "شب بخیر، چشمان زیبایم. در تاریکی شب، نگاه تو مانند یک شعله در دلم می‌درخشد.",

    "شب بخیر، دلدارم. با تو، همیشه در خواب می‌پیمایم و در خواب تو به اوج خوشبختی می‌رسم.",

    "شب بخیر، بوسه‌های نیمه شبم. هر شب در خاطراتم به لبهای تو بوسه می‌زنم.",

    "شب بخیر، نغمهٔ آرامشم. در تاریکی شب، ملودی آرامش تو مرا به سوی خواب می‌برد.",

    "شب بخیر، آرامش عشقم. در هر شب، در دستان آرامش تو دلم را به خواب می‌سپارم.",

    "شب بخیر، نسیم عاشقانهٔ شب. هر شب در برف تو نسیم عشق را در دلم احساس می‌کنم.",

    "شب بخیر، خاطرات عشقم. در تاریکی شب، خاطرات ما را به خواب می‌برم و در خواب به آرزوهایمان می‌رسیم.",

    "شب بخیر، ستارهٔ راهنمای عشقم. در هر شب، به راهنمایی تو در زندگیم امیدوارم.",

    "شب بخیر، آغوش عشق من. در آغوش تاریکی شب، به تمام دردها و رنج‌هایمان پایان می‌دهیم.",

    "شب بخیر، رویاهای دلبازم. هر شب در خواب، با تو رویاهای زندگی خوبی را تجسم می‌کنم.",

    "شب بخیر، قصهٔ عاشقانهٔ شب. در هر شب، قصهٔ عشقمان را برایتان می‌نویسم و در خواب به پایان خوشی می‌رسیم.",

    "شب بخیر، غمگین ترین خنده‌هایم. در تاریکی شب، غم و اندوهم را به خواب می‌برم و در خواب با خنده‌های عاشقانه بیدار می‌شوم.",

    "شب بخیر، سایهٔ زندگیم. در هر شب، سایهٔ تو در کنارم راحتی و امید به زندگیم می‌دهد.",

    "شب بخیر، اشک‌های نیمه شبم. هر شب در تاریکی، اشک‌های عاشقانه‌ام را به روی خاطراتم می‌ریزم.",

    "شب بخیر، خاطرات گمشده‌ام. در هر شب، خاطرات عاشقانه‌ام را به خواب می‌برم و در خواب به دنبالشان می‌گردم.",

    "شب بخیر، زخم‌های پنهانم. در تاریکی شب، زخم‌های عشق را به خواب می‌برم و در خواب به شفای آنها می‌رسم.",

    "شب بخیر، ناگفته‌های دلم. در هر شب، ناگفته‌های عاشقانه‌ام را به تو می‌گویم و به خواب می‌برم.",

    "شب بخیر، آرزوهای پنهانم. هر شب در خواب، به آرزوهای عشقمان پرواز می‌کنم و در صبح به آنها نزدیکتر می‌شوم.",

    "شب بخیر، دلتنگی‌های دوران عشق. در تاریکی شب، به دلتنگی‌های عشقم روی می‌آورم و در خواب به آنها می‌رسم.",

    "شب بخیر، دستان پرمهر عشق. در هر شب، دستان عاشقانه‌ات را به خواب می‌برم و در خواب به تمام احساسشان نزدیک می‌شوم.",

    "شب بخیر، عشق من. در تاریکی شب، با تو در آغوش تو خواب می‌برم و در خواب به عشق تو زنده می‌شوم.",

    "شب بخیر، لبخند آرامشم. هر شب در خواب، لبخند عاشقانه‌ات را در دلم حفظ می‌کنم و در صبح با آن زنده می‌شوم.",

    "شب بخیر، دلدادهٔ تاریکی شبم. در هر شب، در آغوش تاریکی شب تو را در دلم جا می‌دهم و با خواب به تمامی امیدهایم دست می‌یابم.",

    "شب بخیر، تیک‌تاک عاشقانهٔ زمان. در تاریکی شب، تیک‌تاک عشقمان را در زمان احساس می‌کنم و در خواب به تمامی خاطراتمان سفر می‌کنم.",

    "شب بخیر، سحر زیبای عشقم. هر شب در سکوت شب، به سحر عشقم امیدوار می‌شوم و در خواب به پایانی شاد دست می‌یابم.",

    "شب بخیر، رویای ناپدیدمان. در هر شب، به رویاهای ناپدیدمان عشقم پناه می‌برم و در خواب به حقیقتشان نزدیکتر می‌شوم.",

    "شب بخیر، دل‌پیچه‌های دلم. در تاریکی شب، دل‌پیچه‌های عشقم را به خواب می‌برم و در خواب به شادی و آرامش دست می‌یابم.",

    "شب بخیر، خاطرات تلخ عشقم. هر شب در خواب، به خاطرات تلخ عشقم قدرت می‌دهم و در صبح با خاطرات شیرین به روی زندگی می‌خندم.",

    "شب بخیر، ترانه‌های نیمه شبم. در هر شب، ترانه‌های عاشقانه‌ام را در خواب می‌خوانم و با صبح به آواز زندگی می‌پردازم.",

    "شب بخیر، دستان آرامش عشقم. در تاریکی شب، دستان آرامش عشقم را به خواب می‌برم و در خواب به آرامش بی‌نهایت می‌رسم.",

    "شب بخیر، زخم‌های نهان عشقم. هر شب در خواب، به زخم‌های نهان عشقم قدرت می‌بخشم و در صبح با شفای آنها به امید و شادی می‌پردازم.",

    "شب بخیر، بوسه‌های معنادارم. در هر شب، بوسه‌های عاشقانه به خاطراتم می‌زنم و با صبح به خاطرات شیرین دست می‌یابم.",

    "شب بخیر، رویاهای نورانیم. در تاریکی شب، به رویاهای نورانی عشقم پرواز می‌کنم و در خواب به نور راهنمایی می‌رسم.",

    "شب بخیر، غرق شب‌های تنهاییم. هر شب در غم تنهایی، با عشق تو غرق می‌شوم و در خواب با شادی و امید به زندگیم برمی‌خیزم.",

    "شب بخیر، دلبری عشقم. در هر شب، در دلبری تو به خواب می‌روم و با صبح به دلبری تو در زندگیم تلاش می‌کنم.",

    "شب بخیر، نازنین دلم. در تاریکی شب، به خاطر تو نازنینم، در دلم نیازمندی و در خواب به پاسخی عاشقانه می‌رسم.",

    "شب بخیر، یادآوری عشقم. هر شب در خاطره‌ها، یادآوری عشق را به خواب می‌برم و با صبح به خاطرات شیرین دست می‌یابم.",

    "شب بخیر، خاطرات خنده‌دارم. در هر شب، خنده‌های عاشقانه را در خاطراتم نگه می‌دارم و با صبح با خنده به روی زندگی می‌خندم.",

    "شب بخیر، رویاهای دلبازم. در تاریکی شب، به رویاهای عشقم پرواز می‌کنم و در خواب به پایانی شاد و آرزومند دست می‌یابم.",

    "شب بخیر، قصهٔ عاشقانهٔ شب. در هر شب، به قصهٔ عشقمان روایت می‌کنم و در خواب به پایانی خوشحال و رضایتمند می‌رسیم.",

    "شب بخیر، دستان همراهی عشقم. در تاریکی شب، دستان همراهی تو را به خواب می‌برم و در خواب به همراهی دائمی تو دست می‌یابم.",

    "شب بخیر، نفس‌های آرامشم. هر شب در نفس‌های آرامش عشقم عمیق می‌شوم و با صبح به آرامش و سکوت درونی دست می‌یابم.",

    "شب بخیر، عشق ممنوعهٔ دلم. در هر شب، به عشق ممنوعهٔ دلم در خواب پناه می‌برم و با صبح با عشق راهی نامحدود دست می‌یابم.",

    "شب بخیر، اشک‌های خاموشم. در تاریکی شب، اشک‌های عاشقانه را به خواب می‌برم و در خواب به آرامش و امید پایانی می‌یابم.",

    "شب بخیر، خاطرات از دست رفته‌ام. هر شب در خواب، به خاطرات عاشقانه‌ام پناه می‌برم و با صبح به پیدا کردن خاطراتم دست می‌یابم.",

    "شب بخیر، نگاه‌های عاشقانهٔ تو. در هر شب، به نگاه عاشقانهٔ تو می‌پیچم و در خواب با نگاهت به تمامی دلخوشی‌ها دست می‌یابم.",

    "شب بخیر، سایهٔ عاشقانهٔ دلم. در تاریکی شب، سایهٔ عاشقانهٔ دلم را به خواب می‌برم و با صبح به تمامی آرزوهایم نزدیکتر می‌شوم.",

    "شب بخیر، پناهگاه عشقم. هر شب در پناهگاه عشق تو، خود را به خواب می‌برم و در خواب به پایانی شاد و امیدوار دست می‌یابم.",

    "شب بخیر، قلب نازنینم. در هر شب، قلب عاشقانهٔ تو را به خواب می‌برم و با صبح به قلب تو نزدیکتر می‌شوم.",

    "شب بخیر، رویاهای شیرینم. در تاریکی شب، به رویاهای شیرین عشقم می‌پیوندم و در خواب به زندگی رویایی می‌رسم.",

    "شب بخیر، دلتنگی‌های عشقم. هر شب در دلتنگی عاشقانه، به تو فکر می‌کنم و در خواب به دستی برای بغض دلتنگی دست می‌یابم.",

    "شب بخیر، پنجرهٔ عشقم. در هر شب، پنجرهٔ عشق تو را باز می‌کنم و با صبح به تمامی زیبایی‌های دنیا نگاه می‌کنم.",

    "شب بخیر، نغمه‌های عاشقانهٔ تو. در تاریکی شب، به نغمه‌های عشق تو گوش می‌دهم و در خواب به ملودی عاشقانه می‌پیوندم.",

    "شب بخیر، دلانگیزهای غریبه. هر شب در غریبگی تنهایی، به دلانگیزهای عاشقانه فکر می‌کنم و با صبح به گرما و دلنوازی دست می‌یابم.",

    "شب بخیر، سکوت عاشقانهٔ دلم. در هر شب، به سکوت عشقم پناه می‌برم و با صبح به سکوتی زیبا درونی دست می‌یابم.",

    "شب بخیر، روزگار عاشقانهٔ تو. در تاریکی شب، به روزگار عاشقانهٔ تو فکر می‌کنم و در خواب به شادی و خوشبختی پایانی می‌یابم.",

    "شب بخیر، غم‌های ناگفتهٔ دلم. هر شب در تاریکی شب، به غم‌های ناگفتهٔ عشقم فکر می‌کنم و با صبح به آرامشی بی‌نهایت دست می‌یابم.",

    "شب بخیر، ترانه‌های عاشقانهٔ تو. در هر شب، به ترانه‌های عشق تو گوش می‌دهم و در خواب به شور و شعف عشق می‌رقصم.",

    "شب بخیر، ساعات خاموشم. در تاریکی شب، به ساعات خاموش با عشقم فکر می‌کنم و در خواب به امیدی جدید دست می‌یابم.",

    "شب بخیر، بغض تنهایی‌های دلم. هر شب در تنهایی، بغض تنهایی‌های عشقم را به خواب می‌برم و با صبح به تمامی خواسته‌های دل دست می‌یابم.",

    "شب بخیر، غروب عاشقانهٔ دلم. در هر شب، به غروب عشقم شاعری می‌کنم و با صبح به طلوع عاشقانهٔ دلم نزدیکتر می‌شوم.",

    "شب بخیر، دلخوشی‌های گمشده‌ام. هر شب در خواب، به دلخوشی‌های گمشده عشقم پی می‌برم و با صبح به پیدا کردن دلخوشی‌هایم دست می‌یابم.",

    "شب بخیر، تکه‌های عاشقانهٔ دلم. در تاریکی شب، تکه‌های عاشقانهٔ دلم را در خواب می‌چینم و با صبح به قطعاتی کامل و زیبا دست می‌یابم.",

    "شب بخیر، گیسوان شبانهٔ عشقم. در هر شب، به گیسوان شبانهٔ عشق تو خیره می‌شوم و در خواب به زیبایی و انس با آنها دست می‌یابم.",

    "شب بخیر، شعله‌های پنهان دلم. در تاریکی شب، به شعله‌های پنهان عشقم پی می‌برم و با صبح به روشنایی و انرژی جدید دست می‌یابم.",

    "شب بخیر، آرامش عاشقانهٔ دلم. هر شب در آغوش آرامش عشقم پناه می‌برم و با صبح به آرامش و آرامش‌بخشی دست می‌یابم.",

    "شب بخیر، خنده‌های بی‌پایانم. در هر شب، به خنده‌های بی‌پایان عشق تو می‌خندم و با صبح به خنده‌های شاد و آزاد دست می‌یابم.",

    "شب بخیر، نگاهی به تاریکی شب. در تاریکی شب، به تاریکی و سکوت عشق تو فکر می‌کنم و در خواب به روشنایی و امید دست می‌یابم.",

    "شب بخیر، قطره‌های شیرین عشقم. هر شب در قطره‌های شیرین عشقم غرق می‌شوم و با صبح به شیرینی و شکوفایی دست می‌یابم.",

    "شب بخیر، هم‌نوایی با شب‌های تاریکم. در هر شب، با شب‌های تاریک و غمگینم هم‌نوا می‌شوم و با صبح به هماهنگی و همراهی دست می‌یابم.",

    "شب بخیر، عاشقی‌های ناگفتهٔ دلم. در تاریکی شب، به عاشقی‌های ناگفتهٔ دلم پناه می‌برم و در خواب به عشقی بیان‌نشده دست می‌یابم.",

    "شب بخیر، نوری در تاریکی شب. هر شب در تاریکی شب، نور عشق تو را به خواب می‌برم و با صبح به تمامی رنگ‌ها و نورها دست می‌یابم.",

    "شب بخیر، رقص عاشقانهٔ دلم. در هر شب، با رقص عاشقانه در خواب، به هماهنگی و رشد عشق تو پی می‌برم و با صبح به هم‌رقصی با زندگی دست می‌یابم.",

    "شب بخیر، قدرت رویاهای عشقم. در تاریکی شب، به قدرت و تأثیر رویاهای عشق تو فکر می‌کنم و در خواب به دنیایی بی‌نهایت دست می‌یابم.",

    "شب بخیر، آغاز دوبارهٔ دلم. هر شب در آغاز دوبارهٔ عشق تو، دلم را به خواب می‌برم و با صبح به شروعی تازه و پرانرژی دست می‌یابم.",

    "شب بخیر، ترانه‌هایی بی‌انتها. در هر شب، به ترانه‌های بی‌انتها و پایان‌ناپذیر عشق تو گوش می‌دهم و در خواب به موسیقی و هم‌سازی دست می‌یابم.",

    "شب بخیر، حس عمیق عشقم. در تاریکی شب، به حس عمیق و احساس عاشقانه‌ام فکر می‌کنم و در خواب به زیبایی و پیوند با حس خود دست می‌یابم.",

    "شب بخیر، هموارهٔ موجود عشقم. هر شب به هموارهٔ موجودی عشق تو فکر می‌کنم و با صبح به وجود عاشقانهٔ خودم پی می‌برم.",

    "شب بخیر، آرزوهای نامحدود دلم. در تاریکی شب، به آرزوهای نامحدود عشقم پناه می‌برم و در خواب به بهترین و پرمهرترین آرزوهایم دست می‌یابم.",

    "شب بخیر، دلسوزی‌های عشقم. هر شب در دلسوزی عاشقانهٔ تو به خواب می‌رود و با صبح به تمامی محبت و نگرانی‌های دلم دست می‌یابم.",

    "شب بخیر، برقصان با ستارگان. در هر شب، با ستارگان به رقص می‌پردازم و در خواب به آزادی و خوشبختی بی‌نهایت دست می‌یابم.",
]

general_messages = [
    "تو عشق منی.♥",
    "تنهام نذار.♥",
    "تو همیشه در قلبمی.♥",
    "تو همه چیز برامی.♥",
    "دنیا بدون تو بی‌رنگه.♥",
    "تو تنها عشق منی.♥",
    "هر روزت بهتر از دیروقت.♥",
    "تو منو خندون کنی.♥",
    "با تو همیشه خوشبختم.♥",
    "عشقت یه جادوست.♥",
    "تو نور چشمامی.♥",
    "با تو بهشتم.♥",
    "تو عشقمی و همین کافیه.♥",
    "برای تو همه چیز می‌کنم.♥",
    "دلم برای تو می‌تپه.♥",
    "تو زندگیمی.♥",
    "تو خیالم رو به حقیقت تبدیل می‌کنی.♥",
    "عاشق توام تا ابد.♥",
    "تو محو نگات میشم.♥",
    "با تو هر چیزی ممکنه.♥",
    "دنیا با تو زیباتره.♥",
    "تو نفس منی.♥",
    "تو تنها دلگیریم.♥",
    "تو عشق من هستی.♥",
    "با تو همه چیز می‌تونم.♥",
    "تو قلبمو می‌شنوی؟♥",
    "تو می‌دونی چقدر دوستت دارم؟♥",
    "تو برام همه چیزی.♥",
    "همیشه بهت فکر می‌کنم.♥",
    "عشقمون پایداره.♥",
    "تو شیرینی زندگیمی.♥",
    "تو حسابی خاصی.♥",
    "عشق تو داره دلمو می‌گیره.♥",
    "تو تمام حس‌هامی.♥",
    "عشقم بی‌نهایته.♥",
    "تو جواب همه سوالامی.♥",
    "تو برام یه معنای واقعی داری.♥",
    "همیشه بهت افتخار می‌کنم.♥",
    "عشق تو بهترین هدیه‌ایه که داشتم.♥",
    "تو درخشش زندگیمی.♥",
    "تو باعث شدی تا به عشق بیام.♥",
    "عشق تو دروغ نداره.♥",
    "همیشه کنارت می‌مونم.♥",
    "تو برام همه چیز هستی.♥",
    "دنیا با تو جا داره.♥",
    "تو آرامشمی.♥",
    "تو انگیزه‌امی.♥",
    "با تو همیشه خوشحالم.♥",
    "عشق تو همیشه در قلبمه.♥",
    "تو حرفهای تو رو دوست دارم.♥",
    "با تو بهترین لحظات رو سپری می‌کنم.♥",
    "تو بهترین خاطراتمی.♥",
    "عشق تو جزوی از هوای منه.♥",
    "با تو همه چیز رو می‌پذیرم.♥",
    "تو دنیامی.♥",
    "عشق تو مثل بارونه، همه چیز رو تازه می‌کنه.♥",
    "تو برام یه خواب خوبی.♥",
    "با تو همه چیز ساده می‌شه.♥",
    "تو بهترین هدیه‌امی.♥",
    "عشق تو قوی‌تر از هرچیزیه.♥",
    "تو برام همه چیزی.♥",
    "با تو همیشه بهترینم.♥",
    "تو همیشه پشتمی.♥",
    "عشق تو بهترین انتخابم بود.♥",
    "تو تویی که زندگیمو پر رنگ می‌کنی.♥",
    "تو نور چشمانمی.♥",
    "با تو هر لحظه‌ای بهتر از قبلم.♥",
    "عشق تو دنیامو روشن می‌کنه.♥",
    "تو تویی که قلبمو می‌دونی.♥",
    "تو همیشه دلمو به تپش می‌ندازی.♥",
    "عشق تو مثل باده، همیشه در اطرافمه.♥",
    "تو عشقمی، من عاشق تو.♥",
    "با تو همیشه به رویای عاشقانه می‌رسم.♥",
    "تو بهترین چیزی هستی که برام اتفاق افتاده.♥",
    "تو عشقی که همیشه دنبالش بودم.♥",
    "با تو همه نگاه‌ها زیباست.♥",
    "عشق تو روزمو نورانی می‌کنه.♥",
    "تو تکیه‌گاه و آرامشمی.♥",
    "تو تنها دلگیریم.♥",
    "عشق تو همیشه در قلبم حک شده.♥",
    "تو نوری که همیشه در تاریکی‌هام می‌درخشی.♥",
    "با تو همه چیز رو فراموش می‌کنم.♥",
    "تو قلبمو می‌خونی.♥",
    "تو عشق منی و هیچکس نمی‌تونه جای تو رو بگیره.♥",
    "با تو همه چیز بی‌نهایته.♥",
    "عشق تو بهترین همراهمه.♥",
    "تو موجودی که همیشه برام قدرت می‌ده.♥",
    "تو تنها چیزی هستی که دلم می‌خواد.♥",
    "عشق تو مثل داروییه که بهم انرژی می‌ده.♥",
    "تو دنیا رو برام زیبا کردی.♥",
    "با تو همه چیز رو می‌تونم.♥",
    "تو بهترین جواب برای سوالاتمی.♥",
    "تو برام همه چیزهایی که همیشه دنبالش بودم.♥",
    "عشق تو برام خاصه.♥",
    "تو تنها کسی هستی که دنبالش می‌گردم.♥",
    "تو برام قویترین نیرویی.♥",
    "عشق تو تویی که دلم رو می‌شکنه.♥",
    "با تو همه چیز به روال خودش برمی‌گرده.♥",
    "تو تکیه‌گاه قلبمی.♥",
    "تو عشق منی و هیچکس نمی‌تونه جای تو رو پر کنه.♥",
]

voice_messages = [
    'voice1.ogg',
    'voice2.ogg',
    'voice3.ogg'
]

photos = [
    'photo1.jpg',
    'photo2.jpg',
    'photo3.jpg'
]

def send_message(client, phone, message):
    client.send_message(phone, message)
    print(f"Message sent: {message}")

def send_voice(client, phone, voice_file):
    client.send_file(phone, voice_file, voice_note=True)
    print(f"Voice message sent: {voice_file}")

def send_photo(client, phone, photo_file):
    client.send_file(phone, photo_file)
    print(f"Photo sent: {photo_file}")

def send_specific_good_morning_messages(client, phone):
    for message in good_morning_messages:
        send_message(client, phone, message)
        time.sleep(1)  # Delay between each message

def send_specific_good_night_message(client, phone):
    message = random.choice(good_night_messages)
    send_message(client, phone, message)

def send_random_messages(client, phone):
    # Randomly select a message type to send
    message_type = random.choice(['text', 'voice', 'photo'])

    if message_type == 'text':
        message = random.choice(general_messages)
        send_message(client, phone, message)
    elif message_type == 'voice':
        voice_file = random.choice(voice_messages)
        send_voice(client, phone, voice_file)
    elif message_type == 'photo':
        photo_file = random.choice(photos)
        send_photo(client, phone, photo_file)

with TelegramClient('session_name', api_id, api_hash) as client:
    while True:
        current_time = datetime.now().time()
        start_time_morning = datetime.strptime('06:00:00', '%H:%M:%S').time()
        end_time_morning = datetime.strptime('07:00:00', '%H:%M:%S').time()
        start_time_general = datetime.strptime('09:00:00', '%H:%M:%S').time()
        end_time_general = datetime.strptime('22:00:00', '%H:%M:%S').time()
        start_time_night = datetime.strptime('22:00:00', '%H:%M:%S').time()
        end_time_night = datetime.strptime('22:30:00', '%H:%M:%S').time()

        if start_time_morning <= current_time <= end_time_morning:
            send_specific_good_morning_messages(client, phone_number)
        elif start_time_general <= current_time <= end_time_general:
            send_random_messages(client, phone_number)
        elif start_time_night <= current_time <= end_time_night:
            send_specific_good_night_message(client, phone_number)

        # Calculate time until the next day's start time
        next_day = datetime.now() + timedelta(days=1)
        next_day_start = datetime.combine(next_day.date(), start_time_morning)
        sleep_time = (next_day_start - datetime.now()).total_seconds()

        # Sleep until the next day's start time
        time.sleep(sleep_time)

